CSI API ETABS v1
cHelper.GetObject Method
 Attaches to the active running instance of the program.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI GetObject(
	string typeName
)
Function GetObject (
	typeName As String
) As cOAPI
Dim instance As cHelper
Dim typeName As String
Dim returnValue As cOAPI
returnValue = instance.GetObject(typeName)
cOAPI^ GetObject(
	String^ typeName
)
abstract GetObject :
        typeName : string -> cOAPI
Parameters
typeName
Type: System.String
The program ID of the API object.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.GetObject("CSI.ETABS.API.ETABSObject")
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace